---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonPerimeter
source: html/e5ae3072-b4d7-b964-d8fd-755e2300ee6b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonPerimeter Property

"Perimeter"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonPerimeter { get; }
```